Revit 2027 API
BuiltInFailures.AutoRouteFailures.NoSolutionInView Property
 There is no solution for this view. All the elements have been filtered for this view, select another view, and select solutions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSolutionInView { get; }
Public Shared ReadOnly Property NoSolutionInView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSolutionInView {
	FailureDefinitionId^ get ();
}
static member NoSolutionInView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace